zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_uart_ex.c
    /* Disable Transmitter */
    CLEAR_BIT(huart->Instance->CR1, USART_CR1_TE);

    /* Clear AUTOCR register */
    CLEAR_REG(huart->Instance->AUTOCR);

    /* UART AUTOCR Configuration */
    if (IS_LPUART_INSTANCE(huart->Instance))
    {
      tmpreg = ((sConfig->DataSize << USART_AUTOCR_TDN_Pos) | (sConfig->TriggerPolarity) | \
                (sConfig->AutonomousModeState) | (sConfig->IdleFrame) | \
                (sConfig->TriggerSelection << USART_AUTOCR_TRIGSEL_Pos));
    }
    else
    {
#if defined(STM32MP21xxxx)
      tmpreg = ((sConfig->DataSize << USART_AUTOCR_TDN_Pos) | (sConfig->TriggerPolarity) | \
                (sConfig->AutonomousModeState) | (sConfig->IdleFrame) | \
                (sConfig->TriggerSelection << USART_AUTOCR_TRIGSEL_Pos));
#else
      tmpreg = ((sConfig->DataSize << USART_AUTOCR_TDN_Pos) | (sConfig->TriggerPolarity) | \
                (sConfig->AutonomousModeState) | (sConfig->IdleFrame));
#endif /* STM32MP21xxxx */
    }
    WRITE_REG(huart->Instance->AUTOCR, tmpreg);

    /* Enable UART */
    __HAL_UART_ENABLE(huart);

    huart->gState = HAL_UART_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(huart);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Get autonomous mode Configuration.
  * @param huart     UART handle.
  * @param sConfig   Autonomous mode structure parameters.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UARTEx_GetConfigAutonomousMode(const UART_HandleTypeDef *huart,
                                                     UART_AutonomousModeConfTypeDef *sConfig)
{
  uint32_t tmpreg;

  /* Read AUTOCR register */
  tmpreg = READ_REG(huart->Instance->AUTOCR);

  /* Fill Autonomous structure parameter */
  sConfig->AutonomousModeState = (tmpreg & USART_AUTOCR_TRIGEN);
  sConfig->TriggerSelection = ((tmpreg & USART_AUTOCR_TRIGSEL) >> USART_AUTOCR_TRIGSEL_Pos);
  sConfig->TriggerPolarity = (tmpreg & USART_AUTOCR_TRIGPOL);
  sConfig->IdleFrame = (tmpreg & USART_AUTOCR_IDLEDIS);
  sConfig->DataSize = (tmpreg & USART_AUTOCR_TDN);

  return HAL_OK;
}

/**
  * @brief Clear autonomous mode Configuration.
  * @param huart  UART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UARTEx_ClearConfigAutonomousMode(UART_HandleTypeDef *huart)
{
  if (huart->gState == HAL_UART_STATE_READY)
  {
    /* Process Locked */
    __HAL_LOCK(huart);

    huart->gState = HAL_UART_STATE_BUSY;

    /* Disable UART */
    __HAL_UART_DISABLE(huart);

    /* Clear AUTOCR register */
    CLEAR_REG(huart->Instance->AUTOCR);

    /* Enable UART */
    __HAL_UART_ENABLE(huart);

    huart->gState = HAL_UART_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(huart);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}
/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup UARTEx_Private_Functions
  * @{
  */

/**
  * @brief Initialize the UART wake-up from stop mode parameters when triggered by address detection.
  * @param huart           UART handle.
  * @param WakeUpSelection UART wake up from stop mode parameters.
  * @retval None
  */
static void UARTEx_Wakeup_AddressConfig(UART_HandleTypeDef *huart, UART_WakeUpTypeDef WakeUpSelection)
{
  assert_param(IS_UART_ADDRESSLENGTH_DETECT(WakeUpSelection.AddressLength));

  /* Set the USART address length */
  MODIFY_REG(huart->Instance->CR2, USART_CR2_ADDM7, WakeUpSelection.AddressLength);

  /* Set the USART address node */
  MODIFY_REG(huart->Instance->CR2, USART_CR2_ADD, ((uint32_t)WakeUpSelection.Address << UART_CR2_ADDRESS_LSB_POS));
}

/**
  * @brief Calculate the number of data to process in RX/TX ISR.
  * @note The RX FIFO depth and the TX FIFO depth is extracted from
  *       the UART configuration registers.
  * @param huart UART handle.
  * @retval None
  */
static void UARTEx_SetNbDataToProcess(UART_HandleTypeDef *huart)
{
  uint8_t rx_fifo_depth;
  uint8_t tx_fifo_depth;
  uint8_t rx_fifo_threshold;
  uint8_t tx_fifo_threshold;
  static const uint8_t numerator[] = {1U, 1U, 1U, 3U, 7U, 1U, 0U, 0U};
  static const uint8_t denominator[] = {8U, 4U, 2U, 4U, 8U, 1U, 1U, 1U};

  if (huart->FifoMode == UART_FIFOMODE_DISABLE)
  {
    huart->NbTxDataToProcess = 1U;
    huart->NbRxDataToProcess = 1U;
  }
  else
  {
    rx_fifo_depth = RX_FIFO_DEPTH;
    tx_fifo_depth = TX_FIFO_DEPTH;
    rx_fifo_threshold = (uint8_t)(READ_BIT(huart->Instance->CR3, USART_CR3_RXFTCFG) >> USART_CR3_RXFTCFG_Pos);
    tx_fifo_threshold = (uint8_t)(READ_BIT(huart->Instance->CR3, USART_CR3_TXFTCFG) >> USART_CR3_TXFTCFG_Pos);
    huart->NbTxDataToProcess = ((uint16_t)tx_fifo_depth * numerator[tx_fifo_threshold]) /
                               (uint16_t)denominator[tx_fifo_threshold];
    huart->NbRxDataToProcess = ((uint16_t)rx_fifo_depth * numerator[rx_fifo_threshold]) /
                               (uint16_t)denominator[rx_fifo_threshold];
  }
}
/**
  * @}
  */

#endif /* HAL_UART_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

